# Filter col and row

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [19]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## 1) loc

In [47]:
iris.loc[0:3, "sepal_width" :]

   sepal_width  petal_length  petal_width species
0          3.5           1.4          0.2  setosa
1          3.0           1.4          0.2  setosa
2          3.2           1.3          0.2  setosa
3          3.1           1.5          0.2  setosa

row start: row_end (inclusive)

## 1a) filter by row values of specfic columns

In [78]:
# get rows with setosa and petal_length, and columsn with petal_width and species

iris.loc[ (iris.species == "setosa") & (iris.petal_length== 1.4) , 'petal_width': 'species']

    petal_width species
0           0.2  setosa
1           0.2  setosa
4           0.2  setosa
6           0.3  setosa
8           0.2  setosa
12          0.1  setosa
17          0.3  setosa
28          0.2  setosa
33          0.2  setosa
37          0.1  setosa
45          0.3  setosa
47          0.2  setosa
49          0.2  setosa

- better than chaining as below

In [81]:
iris[(iris.species == "setosa") & (iris.petal_length== 1.4) ].petal_width

0     0.2
1     0.2
4     0.2
6     0.3
8     0.2
12    0.1
17    0.3
28    0.2
33    0.2
37    0.1
45    0.3
47    0.2
49    0.2
Name: petal_width, dtype: float64

## 2) iloc
[: 0:4]

In [37]:
iris.iloc[0:3, 0:2]

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

row_start: row_end (exclusive) , col_start: col_end (exclusive)

# pivot columns

In [80]:
tips = sns.load_dataset('tips')
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [70]:
A = tips.groupby(['sex', 'smoker'])[['total_bill', 'tip']].sum()
A

               total_bill     tip
sex    smoker
Male   Yes        1337.07  183.07
       No         1919.75  302.00
Female Yes         593.27   96.74
       No          977.68  149.77

# Modify column

### a) apply(lambda, axis)

In [71]:
A['tip']= A['tip'].apply(lambda x: "{:02}".format(x %100))
A

               total_bill                tip
sex    smoker
Male   Yes        1337.07              83.07
       No         1919.75                2.0
Female Yes         593.27              96.74
       No          977.68  49.77000000000001

In [83]:
tips2= tips.copy()
tips2['Extra']= tips2.apply(lambda row: row['tip']/ row['total_bill'], axis =1)
tips2

     total_bill   tip     sex smoker   day    time  size     Extra
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

# Combine Dataframes
- merge/ join
- concat/ append

## 1) Merge
- column-wise combinations in SQL-like way.

In [40]:
from io import StringIO
with StringIO("""x,y,z
bug,1,d
rug,2,d
lug,3,d
mug,4,d""") as fp:
    A = pd.read_csv(fp)
print("=== table A ===")
display(A)

with StringIO("""x,y,w
hug,-1,e
smug,-2,e
rug,-3,e
tug,-4,e
bug,1,e""") as fp:
    B = pd.read_csv(fp)
print("\n=== table B ===")
display(B)

=== table A ===

     x  y  z
0  bug  1  d
1  rug  2  d
2  lug  3  d
3  mug  4  d

=== table B ===

      x  y  w
0   hug -1  e
1  smug -2  e
2   rug -3  e
3   tug -4  e
4   bug  1  e

### a) Merge on column name

In [42]:
C = A.merge(B, on= ['x', 'y'], how = 'outer')
C

      x  y    z    w
0   bug  1    d    e
1   rug  2    d  NaN
2   lug  3    d  NaN
3   mug  4    d  NaN
4   hug -1  NaN    e
5  smug -2  NaN    e
6   rug -3  NaN    e
7   tug -4  NaN    e

In [43]:
C = A.merge(B, on= ['x', 'y'], how = 'left')
C

     x  y  z    w
0  bug  1  d    e
1  rug  2  d  NaN
2  lug  3  d  NaN
3  mug  4  d  NaN